# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a to a variable called cars1 and cars2

In [3]:
cars1 = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv',sep = ',')
cars2 = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv',sep = ',')
print(cars1.head())
print(cars2.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [5]:
cars1 = cars1.loc[:,"mpg":"car"]
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [6]:
cars1.shape[0]

198

In [7]:
cars2.shape[0]

200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [9]:
cars = cars1.append(cars2)
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

In [11]:
cars.shape

(398, 9)

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [15]:
 np.random.randint(15000,73000,398)

array([20458, 27280, 68932, 37469, 49822, 59278, 47091, 52320, 18308,
       35626, 50144, 65427, 25751, 72340, 26158, 47295, 50577, 45788,
       61850, 56910, 24020, 69534, 25539, 37207, 55334, 28136, 47638,
       69222, 50709, 33214, 17986, 30083, 52359, 37127, 16808, 29737,
       68686, 49636, 39838, 21290, 23739, 55523, 36237, 17545, 23340,
       47196, 41013, 37923, 67455, 31058, 52931, 61763, 48681, 64585,
       48780, 69342, 66587, 31235, 61356, 65863, 51369, 63541, 52521,
       42273, 28887, 61290, 28040, 25592, 34292, 35386, 43054, 46555,
       47315, 37770, 62196, 19557, 56664, 72048, 43112, 44736, 47574,
       49107, 25832, 65122, 17999, 35814, 28873, 37826, 52396, 51062,
       61839, 54685, 66602, 31524, 36707, 21708, 53150, 56003, 71922,
       48054, 22350, 18994, 40143, 40799, 47472, 25917, 42720, 20420,
       59800, 31650, 27946, 40925, 29805, 28461, 41871, 27215, 20591,
       17540, 36707, 50130, 23924, 21142, 28087, 49518, 30133, 15603,
       72035, 37603, 56549, 66240, 54046, 69591, 62935, 52882, 72018,
       33820, 42581, 61432, 45199, 36585, 69578, 24361, 54143, 17417,
       37006, 71508, 64684, 25243, 66712, 56933, 68553, 44730, 16614,
       27355, 32983, 23136, 17401, 69625, 45250, 21138, 57747, 68106,
       68732, 50201, 33734, 34253, 57560, 65019, 33096, 49397, 49159,
       71738, 22673, 67243, 32779, 66697, 60870, 57541, 66185, 69931,
       47642, 33433, 34974, 48285, 58404, 54283, 60895, 28985, 34542,
       50195, 18007, 23590, 33235, 42857, 23781, 58575, 49162, 26283,
       35373, 43485, 19240, 53438, 29499, 34477, 43590, 28446, 69270,
       67046, 26877, 40619, 55860, 44980, 33459, 27012, 53838, 18348,
       62835, 38060, 72178, 47747, 17215, 32340, 24986, 16568, 47870,
       39916, 24471, 44417, 46627, 17716, 67430, 30539, 67155, 48984,
       31275, 49945, 70488, 66074, 28523, 61952, 54667, 18185, 56623,
       22559, 26840, 53836, 61948, 31112, 20304, 50935, 16916, 45239,
       49086, 52004, 36403, 40690, 37761, 24845, 42521, 31776, 68462,
       50256, 50653, 56980, 17609, 34878, 69576, 15474, 69315, 42525,
       33845, 32809, 41733, 40512, 15883, 15924, 62125, 65392, 24492,
       57852, 65584, 38421, 18782, 71927, 67207, 19369, 65466, 18116,
       20808, 24045, 26545, 55334, 53840, 32001, 60537, 22081, 67441,
       36587, 28241, 61513, 47809, 63554, 44402, 59501, 18750, 58557,
       40581, 25297, 72515, 70443, 50393, 58504, 44012, 45501, 22547,
       34454, 67376, 66067, 33283, 26676, 71292, 70612, 23691, 55642,
       46352, 62700, 55786, 39142, 59597, 35351, 35995, 60257, 25541,
       40206, 50731, 32424, 20555, 52227, 69179, 45403, 43093, 29662,
       23186, 47311, 56482, 52927, 70388, 67763, 32245, 25738, 21039,
       17984, 36395, 35822, 28160, 48173, 24014, 53619, 60942, 22020,
       39153, 65519, 38779, 53011, 45464, 53527, 39461, 39185, 31001,
       37538, 18243, 30056, 32515, 20259, 29973, 51764, 65586, 27941,
       67071, 29612, 25631, 28060, 32422, 67283, 25838, 66672, 27904,
       49223, 55063, 65524, 38345, 34035, 40840, 59544, 42359, 65596,
       44775, 70784])

### Step 8. Add the column owners to cars

In [17]:
cars['owners'] =  np.random.randint(15000,73000,398)
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,36564
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,39536
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,43240
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,64820
4,17.0,8,302,140,3449,10.5,70,1,ford torino,36143